package com.jinsit.kmec.infrastructure;

/**
 * WorkCD
 * @author 원성민
 * @DATE 2016-01-14
 *
 */
public enum WorkCode {
	CA01, //01.정기점검
	CA02, //03.특별점검
	CA03, //11.고장수리
	CA04, //04.정기검사입회
	CA05, //32.특수작업
	CA07, //21.수리공사
	CA09, //81.상주근무
	CA11, //31.CLAIM
	CA13, //82.호텔vip대기
	CA15, //83.신설대기
	CA17, //05.보수이체검사
	CA19, //02.정기점검지원
	CA21, //12.고장수리지원
	CA23, //22.유상부품교체
	CA25, //23.무상부품교체

	CB01, //91.공장불량
	CB03, //92.설치불량
	CB05, //93.보수불량

	CC01, //07.작업준비(공통)
	CC02, //16.고장 이동
	CC03, //41.고객서비스
	CC04, //06.점검이동
	CC05, //18.고장대기
	CC06, //08.점검대기
	CC07, //51.회의, 교육
	CC08, //26.수리/부품 이동
	CC09, //52.사무정리
	CC10, //46.고객서비스 이동
	CC11, //33.타부서지원
	CC12, //56.사무실복귀
	CC13, //73.향군,민방위
	CC14, //75.사외교육
	CC15, //74.휴가,공상
	CC16, //17.자택복귀
	CC17, //36.CLAIM/특수작업 이동
	CC21, //34.이관검사
	CC22, //35.이관검사이동
	CC23, //36.사무작업
	CC24, //37.재(확인)검사
	CC25, //38.중간검사(형판)
	CC26, //39.중간검사(레일)
	CC27, //40.중간검사_TM
	CC28, //42.중간검사(체대)
	CC29, //53.검사결과입력

	CCB1, //61.점심식사
	CCB3, //62.저녁식사
	CCB5, //63.철야식사
	CCC1, //71.추가(+)
	CCC3, //72.추가(-)
	CCTT, //09.고객상담
	CCZZ, //94.무임금대기시간
	LOG0, //LOG ON
	LOG9  //LOG OFF

//	private String name;
//	private WorkCode(String name){
//		this.name = name;
//	}
//	private String getName(String value){
//		return name;
//	}


}
